----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1         [-1, 32, 224, 224]             896
       BatchNorm2d-2         [-1, 32, 224, 224]              64
         MaxPool2d-3         [-1, 32, 112, 112]               0
            Conv2d-4         [-1, 32, 112, 112]           9,248
       BatchNorm2d-5         [-1, 32, 112, 112]              64
         MaxPool2d-6           [-1, 32, 56, 56]               0
            Conv2d-7           [-1, 64, 56, 56]          18,496
       BatchNorm2d-8           [-1, 64, 56, 56]             128
         MaxPool2d-9           [-1, 64, 28, 28]               0
           Conv2d-10          [-1, 128, 28, 28]          73,856
      BatchNorm2d-11          [-1, 128, 28, 28]             256
        MaxPool2d-12          [-1, 128, 14, 14]               0
           Conv2d-13          [-1, 128, 14, 14]         147,584
      BatchNorm2d-14          [-1, 128, 14, 14]             256
        MaxPool2d-15            [-1, 128, 7, 7]               0
           Conv2d-16             [-1, 64, 7, 7]           8,256
      BatchNorm2d-17             [-1, 64, 7, 7]             128
        MaxPool2d-18             [-1, 64, 3, 3]               0
AdaptiveAvgPool2d-19             [-1, 64, 1, 1]               0
           Linear-20                  [-1, 525]          34,125
          Dropout-21                  [-1, 525]               0
           Linear-22                  [-1, 525]         276,150
================================================================
Total params: 569,507
Trainable params: 569,507
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.57
Forward/backward pass size (MB): 40.12
Params size (MB): 2.17
Estimated Total Size (MB): 42.86
----------------------------------------------------------------
---------------------------------------------
Optimizer: Adam
Scheduler: ReduceLROnPlateau
Loss: CrossEntropyLoss
---------------------------------------------



Test accuracy: 89.90%
Loss over time: [4.717921597719913, 3.409873171155186, 2.819434214214544, 2.4474009547348827, 2.1743688381690633, 1.9938586581149491, 1.8486170192499536, 1.67389743817897, 1.5872476945470828, 1.5149952074192081, 1.4571730886161147, 1.4000712914049085, 1.355260361807584, 1.2690425370214928, 1.2253554386854892, 1.1972123667192602, 1.1687892660993824, 1.145384998930185, 1.1119678581409225, 1.059382454866369, 1.0371569430179826, 1.0144702873201168, 0.9991858752832672, 0.9783456282313137, 0.9743935325354608, 0.9229995373332609, 0.9139509558497599, 0.9011237403867468, 0.8873786061912144, 0.8830865616164538, 0.8743835896523697, 0.8407796721263955, 0.8310790204209504, 0.816499553238157, 0.8062381029038991, 0.8031022694986032, 0.7955284727304004, 0.7740386308049868, 0.7568485326277166, 0.7533167484933876, 0.755407863918388, 0.7449947899922144, 0.7362009663686291, 0.7162134070230755, 0.711496344415803, 0.7090573427900447, 0.7043486256883944, 0.6958179380688423, 0.6893202836239806, 0.6758530370418399, 0.6682171442537509, 0.6717015263087079, 0.6613633745656633, 0.6601253336469932, 0.6515391440640044, 0.6450177660251312, 0.6394116854649656, 0.6355119948120636, 0.6355098760560199, 0.6286232272933977, 0.6312642143392131, 0.6150146160060905, 0.6108408609905992, 0.6114046816739431, 0.6102487378250075, 0.6094408655184633, 0.6066848521326244, 0.5981267319705191, 0.5919308332428111, 0.5911103906138065, 0.5915875597392685, 0.5896300333144081, 0.5932119331150977, 0.584363966144824]
Accuracies over time: [7.012195121951219, 10.670731707317072, 14.939024390243903, 16.882621951219512, 18.978658536585368, 18.864329268292682, 21.722560975609756, 21.303353658536587, 23.01829268292683, 23.628048780487806, 24.23780487804878, 23.285060975609756, 23.285060975609756, 25.038109756097562, 25.76219512195122, 25.533536585365855, 24.61890243902439, 26.295731707317074, 25.990853658536587, 26.98170731707317, 26.753048780487806, 27.210365853658537, 25.724085365853657, 26.90548780487805, 27.36280487804878, 27.66768292682927, 28.277439024390244, 27.096036585365855, 27.553353658536587, 27.591463414634145, 27.972560975609756, 27.286585365853657, 27.896341463414632, 28.125, 27.70579268292683, 28.163109756097562, 27.896341463414632, 28.58231707317073, 28.163109756097562, 27.972560975609756, 28.8109756097561, 28.048780487804876, 28.239329268292682, 28.125, 28.658536585365855, 29.0015243902439, 28.772865853658537, 28.429878048780488, 29.039634146341463, 28.772865853658537, 29.23018292682927, 28.92530487804878, 29.039634146341463, 28.92530487804878, 29.077743902439025, 29.611280487804876, 29.077743902439025, 29.573170731707318, 29.192073170731707, 29.458841463414632, 29.192073170731707, 29.34451219512195, 29.30640243902439, 29.6875, 29.30640243902439, 29.420731707317074, 29.611280487804876, 29.115853658536587, 29.496951219512194, 29.916158536585368, 29.30640243902439, 29.153963414634145, 29.077743902439025, 29.573170731707318]

Best accuracy 29.916158536585368